cf_billing/DataProcessors/энргПоискУлицВФИАС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>энргПоискУлицВФИАС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводитьНомерПоМаске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСтрануВПредставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоляДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРедактирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьРедактированиеПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлятьУстаревшиеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаНомераТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународныйФорматАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноИзменятьСпособРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьКорректность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПроверятьПоФИАС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьВводНесколькихЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьНеактуальныеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонСДобавочнымНомером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоНациональныйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРедактированиеТолькоВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьОКТМО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВсегда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргУлицыНедобавленныеВФИАС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргУлицыНедобавленныеВФИАС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторГИСЖКХ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавленВФИАС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргПомещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргПомещения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипПомещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКатегорииПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фиктивное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/DataProcessors/энргПоискУлицВФИАС/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоответствиеУлиц

&НаКлиенте
Процедура СоответствиеУлицПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.СоответствиеУлиц.ТекущиеДанные;

	Если ТекСтрока = Неопределено или НЕ ЗначениеЗаполнено(ТекСтрока.УлицаНедобавленнаяВФИАС) тогда
		Возврат;
	КонецЕсли;
		
	УстановитьОтборПоВсемДинамическимСпискам(ТекСтрока.УлицаНедобавленнаяВФИАС);
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеУлицУлицаНедобавленнаяВФИАСПриИзменении(Элемент)
	СтруктураСтрока = СоответствиеУлицУлицаНедобавленнаяВФИАСПриИзмененииНаСервере(Элементы.СоответствиеУлиц.ТекущиеДанные.УлицаНедобавленнаяВФИАС);
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеУлицПредставлениеАдресаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.СоответствиеУлиц.ТекущиеДанные;
	
	МодульУправлениеКонтактнойИнформациейКлиент 		= ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	
	ПараметрыФормыКонтактнойИнформации 					= МодульУправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресНедобавленногоОбъекта"),""); 
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяРеквизита", Элемент.Имя);
		
	ДанныеСтроки 										= Новый Структура("Представление,ЗначенияПолей",ТекСтрока.ПредставлениеАдреса,ТекСтрока.ЗначениеАдреса);
	
	ПараметрыФормыКонтактнойИнформации.Значение		 	= ДанныеСтроки.ЗначенияПолей;
	ПараметрыФормыКонтактнойИнформации.Представление 	= ДанныеСтроки.Представление;
	
	ПараметрыФормыКонтактнойИнформации.Вставить("Заголовок");
	ПараметрыФормыКонтактнойИнформации.Заголовок	 	= "Адрес ФИАС";
	
	Оповещение 											= Новый ОписаниеОповещения("АдресНедобавленногоОбъектаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеЗаполнения",  ДанныеСтроки);
	Оповещение.ДополнительныеПараметры.Вставить("ЭтоТабличнаяЧасть", Ложь);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент",           Элемент);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеСтроки",      ДанныеСтроки);		
	Оповещение.ДополнительныеПараметры.Вставить("Результат",         Результат);
	Оповещение.ДополнительныеПараметры.Вставить("Форма",             ЭтаФорма);
	
	МодульУправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормыКонтактнойИнформации,,Оповещение);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Обработать(Команда)
	ОбработатьНаСервере();
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Обработка завершена'"));
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	СоответствиеУлиц.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргУлицыНедобавленныеВФИАС.Ссылка КАК Ссылка,
	|	энргУлицыНедобавленныеВФИАСКонтактнаяИнформация.Представление КАК Представление,
	|	энргУлицыНедобавленныеВФИАСКонтактнаяИнформация.Значение КАК Значение,
	|	энргУлицыНедобавленныеВФИАСКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей
	|ИЗ
	|	Справочник.энргУлицыНедобавленныеВФИАС.КонтактнаяИнформация КАК энргУлицыНедобавленныеВФИАСКонтактнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргУлицыНедобавленныеВФИАС КАК энргУлицыНедобавленныеВФИАС
	|		ПО энргУлицыНедобавленныеВФИАСКонтактнаяИнформация.Ссылка = энргУлицыНедобавленныеВФИАС.Ссылка
	|			И (энргУлицыНедобавленныеВФИАСКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресНедобавленногоОбъекта))
	|ГДЕ
	|	НЕ энргУлицыНедобавленныеВФИАС.ПометкаУдаления
	|	И НЕ энргУлицыНедобавленныеВФИАС.ДобавленВФИАС";
	
	РезультатЗапроса 		= Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
	
	МенеджерУлиц 			= Справочники.энргУлицыНедобавленныеВФИАС;
	ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = СоответствиеУлиц.Добавить();
		
		НовСтр.УлицаНедобавленнаяВФИАС 	= ВыборкаДетальныеЗаписи.Ссылка;
		НовСтр.ПредставлениеАдреса  	= ВыборкаДетальныеЗаписи.Представление;
		
		//УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOПоПредставлению(ВыборкаДетальныеЗаписи.Представление,Перечисления.ТипыКонтактнойИнформации.Адрес);
		//УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияВСтруктуруJSON(УправлениеКонтактнойИнформациейСлужебный.АдресXMLВXDTO(ВыборкаДетальныеЗаписи.ЗначенияПолей, "", Перечисления.ТипыКонтактнойИнформации.Адрес));
		//УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(УправлениеКонтактнойИнформациейСлужебный.АдресXMLВXDTO(ВыборкаДетальныеЗаписи.ЗначенияПолей, "", Перечисления.ТипыКонтактнойИнформации.Адрес));
		//УправлениеКонтактнойИнформациейСлужебный.АдресXMLВXDTO(ВыборкаДетальныеЗаписи.ЗначенияПолей, "", Перечисления.ТипыКонтактнойИнформации.Адрес);
		//УправлениеКонтактнойИнформациейСлужебный.ПривестиКонтактнуюИнформациюXML(ВыборкаДетальныеЗаписи.Значение);
		
		СтрокаJSON = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(ВыборкаДетальныеЗаписи.Представление,Справочники.ВидыКонтактнойИнформации.АдресНедобавленногоОбъекта);
		Если ЗначениеЗаполнено(Найти(СтрокаJSON,"ВСвободнойФорме")) Тогда
			НовСтр.ЗначениеАдреса  = ВыборкаДетальныеЗаписи.Значение;
		Иначе
			НовСтр.ЗначениеАдреса  = ВыборкаДетальныеЗаписи.Значение;
			//НовСтр.ЗначениеАдреса  = СтрокаJSON;
			НовСтр.УлицаНайдена = Истина;
		КонецЕсли;
		
		НовСтр.НайденоСоответствиеВФИАС = МенеджерУлиц.ЕстьСоответствиеУлицыВФИАС(ВыборкаДетальныеЗаписи.Значение, ТипКонтактнойИнформации);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьНаСервере()
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Обработать", Истина);
	НайденныеСтроки = СоответствиеУлиц.НайтиСтроки(ПараметрыОтбора);
	Для каждого стр из НайденныеСтроки Цикл
		УлицаОб = стр.УлицаНедобавленнаяВФИАС.ПолучитьОбъект();
		УлицаОб.ДобавленВФИАС = Истина;
		СтрокиКИ 							= УлицаОб.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип,Вид",Перечисления.ТипыКонтактнойИнформации.Адрес,Справочники.ВидыКонтактнойИнформации.АдресНедобавленногоОбъекта));
		Если СтрокиКИ.Количество() > 0 Тогда
			СтрокиКИ[0].Представление = стр.ПредставлениеАдреса;
			СтрокиКИ[0].Значение = стр.ЗначениеАдреса;
			СтрокиКИ[0].ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебный.ПривестиКонтактнуюИнформациюXML(стр.ЗначениеАдреса).ДанныеXML;
		КонецЕсли;
		УлицаОб.Записать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСтроения.Ссылка КАК Строение,
		|	энргПомещения.Ссылка КАК Помещение
		|ИЗ
		|	Справочник.энргСтроения КАК энргСтроения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
		|		ПО энргПомещения.Строение = энргСтроения.Ссылка
		|ГДЕ
		|	энргСтроения.УлицаНедобавленнаяВФИАС = &УлицаНедобавленнаяВФИАС
		|ИТОГИ ПО
		|	Строение";
		
		Запрос.УстановитьПараметр("УлицаНедобавленнаяВФИАС", стр.УлицаНедобавленнаяВФИАС);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаСтроение = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСтроение.Следующий() Цикл
			СтроениеОбъект	= ВыборкаСтроение.Строение.ПолучитьОбъект();
			СтруктураКИ 	= ПоправитьКИВОбъекте(СтроениеОбъект, Справочники.ВидыКонтактнойИнформации.АдресДома, СтрокиКИ);
			
			ВыборкаДетальныеЗаписи = ВыборкаСтроение.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() и СтруктураКИ <> Неопределено Цикл
				Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Помещение) Тогда
					Продолжить;
				КонецЕсли;
				
				ПомещениеОб = ВыборкаДетальныеЗаписи.Помещение.ПолучитьОбъект();
				ПоправитьКИВПомещении(ПомещениеОб, ВыборкаДетальныеЗаписи, СтруктураКИ, СтрокиКИ);
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПоправитьКИВОбъекте(Об, Вид, СтрокиКИУлицыНеДобавленнойВФИАС)
	//Об 					= ОбСсылка.ПолучитьОбъект();
	Значение 			= СтрокиКИУлицыНеДобавленнойВФИАС[0].Значение;
	СтрокиКИ			= Об.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип,Вид",Перечисления.ТипыКонтактнойИнформации.Адрес,Вид));
	СтруктураВозврат 	= Неопределено;
	
	Если СтрокиКИ.Количество() > 0 Тогда
		СтруктураБезДома 				= УправлениеКонтактнойИнформациейСлужебный.СтрокаJSONВСтруктуру(Значение);
		СтруктураСтарая 				= УправлениеКонтактнойИнформациейСлужебный.СтрокаJSONВСтруктуру(СтрокиКИ[0].Значение);
		СтруктураБезДома.buildings 		= СтруктураСтарая.buildings;
		СтруктураБезДома.houseNumber 	= СтруктураСтарая.houseNumber;
		СтруктураБезДома.houseType 		= СтруктураСтарая.houseType;
		СтруктураБезДома.Value			= "";
		СтруктураВозврат 				= СтруктураБезДома;
		
		JSONБезПредставления 			= УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(СтруктураБезДома);		
		ФорматКонтактнойИнформации 		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокиКИ[0].Вид, "Тип, ВключатьСтрануВПредставление, ПроверятьПоФИАС");
		ФорматКонтактнойИнформации.Вставить("ФорматАдреса", "ФИАС");
		
		СтруктураБезДома.Value 			= УправлениеКонтактнойИнформациейСлужебный.ПредставлениеКонтактнойИнформации(JSONБезПредставления, ФорматКонтактнойИнформации);
		СтрокиКИ[0].Значение 			= УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(СтруктураБезДома);
		СтрокиКИ[0].Представление 		= СтруктураБезДома.Value;
		
		Об.Наименование 				= Справочники.энргСтроения.СформироватьНаименование(СтрокиКИ[0].Значение);
	КонецЕсли;
	
	Об.Записать();
	
	Возврат  СтруктураВозврат;
КонецФункции

&НаСервере
Процедура ПоправитьКИВПомещении(ПомещениеОб, ВыборкаДетальныеЗаписи, СтруктураКИ, СтрокиКИУлицыНеДобавленнойВФИАС)
	СтрокиКИ	= ПомещениеОб.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип,Вид",Перечисления.ТипыКонтактнойИнформации.Адрес,Справочники.ВидыКонтактнойИнформации.АдресПомещения));
	
	Если СтрокиКИ.Количество() > 0 Тогда
		СтруктураСтарая 			= УправлениеКонтактнойИнформациейСлужебный.СтрокаJSONВСтруктуру(СтрокиКИ[0].Значение);
		СтруктураНовая 				= СтруктураКИ;
		СтруктураНовая.apartments 	= СтруктураСтарая.apartments;
		JSONБезПредставления 		= УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(СтруктураНовая);
		ФорматКонтактнойИнформации 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокиКИ[0].Вид, "Тип, ВключатьСтрануВПредставление, ПроверятьПоФИАС");
		ФорматКонтактнойИнформации.Вставить("ФорматАдреса", "ФИАС");
		
		СтруктураНовая.Value 		= УправлениеКонтактнойИнформациейСлужебный.ПредставлениеКонтактнойИнформации(JSONБезПредставления, ФорматКонтактнойИнформации);
		СтрокиКИ[0].Значение 		= УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(СтруктураНовая);
		СтрокиКИ[0].Представление 	= СтруктураНовая.Value;
		
		ПомещениеОб.Наименование 	= Справочники.энргПомещения.СформироватьНаименование(СтрокиКИ[0].Значение);
	КонецЕсли;
	
	ПомещениеОб.Записать();
КонецПроцедуры

&НаКлиенте
Процедура АдресНедобавленногоОбъектаНачалоВыбораЗавершение(Знач РезультатЗакрытия, Знач ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(РезультатЗакрытия.Значение);
	#Если ВебКлиент Тогда
		СтруктураJSON = ПрочитатьJSONСервер(ЧтениеJSON);
	#Иначе
		СтруктураJSON = ПрочитатьJSON(ЧтениеJSON);	
	#КонецЕсли  
	
	ЧтениеJSON.Закрыть(); 
	
	ТекСтрока = Элементы.СоответствиеУлиц.ТекущиеДанные;
	ТекСтрока.ПредставлениеАдреса	= РезультатЗакрытия.Представление;
	ТекСтрока.ЗначениеАдреса		= РезультатЗакрытия.Значение;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрочитатьJSONСервер(ЧтениеJSON)
	Возврат  ПрочитатьJSON(ЧтениеJSON);
КонецФункции

&НаСервере
Функция СоответствиеУлицУлицаНедобавленнаяВФИАСПриИзмененииНаСервере(УлицаНедобавленнаяВФИАС)
	СтруктураСтрока =  Новый Структура;
	СтруктураСтрока.Вставить("УлицаНайдена", Ложь);
	СтруктураСтрока.Вставить("ПредставлениеАдреса", "");
	СтруктураСтрока.Вставить("ЗначениеАдреса", "");
	
	СтрокиКИ 							= УлицаНедобавленнаяВФИАС.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип,Вид",Перечисления.ТипыКонтактнойИнформации.Адрес,Справочники.ВидыКонтактнойИнформации.АдресНедобавленногоОбъекта));
	
	Если СтрокиКИ.Количество() > 0 Тогда
		СтруктураСтрока.ПредставлениеАдреса = СтрокиКИ[0].Представление; 
		СтрокаJSON = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(СтруктураСтрока.ПредставлениеАдреса,Справочники.ВидыКонтактнойИнформации.АдресНедобавленногоОбъекта);
		Если ЗначениеЗаполнено(Найти(СтрокаJSON,"ВСвободнойФорме")) Тогда
			СтруктураСтрока.ЗначениеАдреса  = СтрокиКИ[0].Значение;
		Иначе
			СтруктураСтрока.ЗначениеАдреса  = СтрокаJSON;
			СтруктураСтрока.УлицаНайдена = Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат СтруктураСтрока;
КонецФункции

&НаСервере
Процедура УстановитьОтборПоВсемДинамическимСпискам(УлицаНедобавленнаяВФИАС)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Помещения,"Строение.УлицаНедобавленнаяВФИАС",УлицаНедобавленнаяВФИАС,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Строения,"УлицаНедобавленнаяВФИАС",УлицаНедобавленнаяВФИАС,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
КонецПроцедуры

#КонецОбласти
